using System;

namespace GB_Lesson2_4
{
    class Program
    {
        static void Main()
        {
            string restName = "KFC ЦПР СМАРТ_TEST_";
            int KPP = 777777;
            long INN = 7722561551;
            string phone = "8 800 555 8 333";
            string add_number = "9999";
            int atCode = 7777777;
            int orderNum = 100014;
            DateTime currDateTime = DateTime.Now;
            double sum = 0;
            string currencyType = "Наличными";
            string cashier = "Боровский Евгений";
            string address = "125171, г.Москва, Старопетровский пр-д, д.10к1";
            string znKKT = "001231242342134234";
            string rnKKT = "00000012312421341234";
            string FN = "273426346523764554";
            int FD = 15;
            string FP = "234235442";
            string operation = "ПРИХОД";

            Console.WriteLine($"                      {restName}\n"+ 
                              "                     ПРИГЛАШАЕМ НА РАБОТУ!\n"+
                              $"                          КПП {KPP}\n"+
                              $"                 Тел. {phone} доб.{add_number}\n"+
                              $"                       КОД АТ {atCode}\n"+
                              "***************************************************************\n"+
                              "                       УВАЖАЕМЫЙ ГОСТЬ!\n"+
                              "               Подари нам шанс стать ещё лучше!\n"+
                              "               Оставь свой отзыв о посещении KFC\n"+
                              "                  на сайте KFCFEEDBACKRUS.com \n"+
                              "               (на страницу опроса можно попасть,\n" +
                              "                   отсканировав QR-код ниже)\n" +
                              "     КОД С САЙТА ПОСЛЕ ЗАПОЛНЕНИЯ ОПРОСА ВПИШИ СЮДА _________\n" +
                              "       И ПОКАЖИ ЭТОТ ЧЕК КАССИРУ ДЛЯ ПОЛУЧЕНИЯ 10% СКИДКИ НА\n" +
                              "     СЛЕДУЮЩИЙ ЗАКАЗ В ЛЮБОМ РЕСТОРАНЕ KFC! ОСТАВАЙСЯ С НАМИ!\n" +
                              "            ▄▄▄▄▄▄▄   ▄ ▄ ▄    ▄ ▄▄▄▄ ▄▄▄▄▄▄▄ ▄▄▄▄▄▄▄    \n" +
                              "            █ ▄▄▄ █ ▀▀█ ▄ ▄██ ▀▄ ▄█▄ ▀ ██  ▄▀ █ ▄▄▄ █    \n" +
                              "            █ ███ █ ▀█ ▀ ▄▄█▄ ▀ ▄▄▀▄▀▀█▀█▄▄ ▄ █ ███ █    \r\n" +
                              "            █▄▄▄▄▄█ █▀▄▀▄ █ ▄ █▀▄ █ ▄▀▄▀▄ █ █ █▄▄▄▄▄█    \r\n" +
                              "            ▄▄▄▄▄ ▄▄▄ ▀ ▀▄▀ █▄▄██▀▀ ▀▄▀██▄ ▀▄▄ ▄ ▄ ▄     \r\n" +
                              "            ▄▄  ██▄▄▄ ▄▀ ███▀█▀▀▄██▀▀ ██▀▄ ▀█▄▀█▀▀ ▀     \r\n" +
                              "            ▀▀ ▀█ ▄▄▄█ ▄ ▀▄▄█▀▀ ▄██▀▄▄█▄▄▄▄▄▄▀▀█ █▄▀▀    \r\n" +
                              "            █▄▄▀▀█▄ ▀▀▄ ▀  █▄▄▀ ▄▀▄▀ █▄██ ▀ ▀▀▀████ ▀    \r\n" +
                              "            █▄▄ █▄▄▀█ ▀ ▀▄▀█  ▀ ▄▀▀  ▄▀▀█▄█▀▀▄ ▀▀▄▄▀     \r\n" +
                              "             █ ▄▄▄▄  ▀█ ▄ ▀▄▄ ▄▀▄▄ ▀▀ ▄██▀▀▀▀█▀ █  █▀    \r\n" +
                              "             ▀▀██▀▄█ ▄▄▀▄ ▀▄▀ ▄  ██▀ ▄▀ █  ▀▀ ▀█ █▄█▀    \r\n" +
                              "            ▄ █▄▀ ▄█▀ ▀▄▄ ▀▀▀  ▄▀▀▄▀ ▄▄▄ █▀▀ ▀██▀█▀ ▀    \r\n" +
                              "            █▀▄▄ ▀▄█▀ ▄█▄▄  █▄████▄▀  ▄▀▀▄▀▀▄▀▀█▄▄▄█▄    \r\n" +
                              "            █▀▀ ▄█▄█▄█ ▀███▄▄█ ▀ █▄▀▀▄█▄  ▀▀█▀▀█▀▄▄▄▀    \r\n" +
                              "            ▀▀█▀▀ ▄█▄█▄  ▀▄█▄▀▀▀ ▀ ▀▄ ▄▀▀▄ ▀▄▄ ▀ ▄▄ ▄    \r\n" +
                              "            █▀  ██▄▀▄ ▄ ▀  █▄▀▀ ▄██▀▄▄ ▄█▄█ █▄██▀▀▄▀▀    \r\n" +
                              "            █ █▀█▀▄ █▄  ▀▄ █▄▄▄ █▀ █ ▄▀▀▄▄  ▄▄█▄█ ▄█     \r\n" +
                              "            ▄▄▄▄▄▄▄ █▄▀▀▀ ▀▄▄ ▄▀ ▄█▀▀▀███▀▀▄█ ▄ █ █▄▀    \r\n" +
                              "            █ ▄▄▄ █ ▄ ▄ █ ▀█  ▄ ▄▀█▀▄▄▄▀▀▄ ▀█▄▄▄██ ▀▀    \r\n" +
                              "            █ ███ █ █▀▀▄▄ ▀▀▀ ▄▀▀▄█▀ ▀▄▄██▀▄▀▄▄ ▄▀▄ ▀    \r\n" +
                              "            █▄▄▄▄▄█ █▀▀█ ▄  █▄▄▀▄▀▀ ▀▄▀█ ▄ █  ▀▄▀█ ▀   \n" +
                              "****************************************************************\n" +
                              "                    Продукция KFC рекомендуется\n" +
                              "             для потребления на территории предприятия\n" +
                              "                    Ваш номер заказа в очереди:\n" +
                              "             ██      ▄██████▄    ▄██████▄    ▄██████▄\n" + 
                              "           ████     ██▀    ▀██  ██▀    ▀██  ██▀    ▀██\n" +
                              "             ██            ▄██         ▄██  ██      ██\n" +
                              "             ██          ▄██▀        ▄██▀   ██▄     ██\n" +
                              "             ██        ▄██▀        ▄██▀      ▀████████\n" +
                              "             ██      ▄██▀        ▄██▀              ▄██\n" +
                              "          ████████  ██████████  ██████████    ██████▀\n" +
                              $"Заказ В ПАКЕТЕ номер: {orderNum}\n" +
                              "                         Кассовый чек\n"+
                              "Баскет Дуэт оригинальный новый\n" +
                              $"  4 шт ОРИГ Стрипсы кур фил                {120.00}*{1}шт          ={sum += 120.00 * 1}\n" +
                              "НДС 10%\n" +
                              $"  2 шт Куриные ножки ОРИГ                  {106.00}*{2}шт          ={sum += 106.00 * 2}\n" +
                              "НДС 10%\n" +
                              $"  4 шт Куриные крылышки                    {123.00}*{1}шт          ={sum += 123.00 * 1}\n" +
                              "НДС 10%\n" +
                              $"  Станд Картофель фри                      {69.00}*{1}шт           ={sum += 69.00 * 1}\n" +
                              "НДС 20%\n" +
                              "----------------------------------------------------------------\n" +
                              $"ИТОГ                                                     ={sum:F}\n" +
                              $"Сумма НДС 20%                                                ={(120+(106*2)+123)*0.2}\n" +
                              $"Сумма НДС 10%                                               ={69 * 0.1}\n" +
                              $"{currencyType}\n" +
                              $"Получено {currencyType}\n" +
                              $"Кассир                                         {cashier}\n" +
                              "ООО \"Ям Ресторантс Раша\"\n" +
                              $"{address}\n" +
                              "Место расчетов                                    Тестовый стенд\n" +
                              "----------------------------------------------------------------\n" +
                              $"ЗН ККТ{znKKT}               █▀▀▀▀▀█ ▀▄███▄█ █ █▀▀▀▀▀█\n" +
                              $"РН ККТ{rnKKT}             █ ███ █ █▄ ▀ ██ ▀ █ ███ █\n" +
                              $"ИНН {INN}                         █ ▀▀▀ █ ▀█ ▀██▀▀█ █ ▀▀▀ █\n" +
                              $"ФН {FN}                  ▀▀▀▀▀▀▀ ▀▄▀▄█ ▀▄█ ▀▀▀▀▀▀▀\n" +
                              $"ФД {FD}                                  █▀██▄ ▀▄█▄  ▀ █ ▄▀  ▀▀▀▄▀\n" +
                              $"ФП {FP}                             █  ▀▄▄▀█▄  █ ▄ ▄█▄█ █▄▄  \n" +
                              $"{operation}                                 ▄▀█▀ ▀  ▀▄▄▄█▄█▄▀██▄ ▀▀█\n" +
                              $"{currDateTime}                    ▄▀▄█▄▀▀ ▄▀▄▄▀ ▀ ██▄▄█ ▀▀▄\n" +
                              $"                                       ▀ ▀▀▀▀▄ █▄ █  █▀▀▀█▀█▀█  \n" +
                              $"                                       █▀▀▀▀▀█   █▄█▀ ▄█ ▀ █ ▀██\n" +
                              $"                                       █ ███ █ ▄▀█▀▀▄▀ █▀█▀██▄██\n" +
                              $"                                       █ ▀▀▀ █ █▄█▀██▄ ▀██▄▀▄█▀\n" +
                              $"                                       ▀▀▀▀▀▀▀ ▀  ▀▀▀▀    ▀▀  ▀▀\n"
                              );
        }
    }
}
